 

 
/**
 *
 * @author  作者：黄泽彬	 E-mail：root@68xg.com
 * @version 创建时间：2015-5-19 上午10:14:18 
 *
 *                #####################################################
 *                #                                                   #
 *                #                       _oo0oo_                     #   
 *                #                      o8888888o                    #
 *                #                      88" . "88                    #
 *                #                      (| -_- |)                    #
 *                #                      0\  =  /0                    #   
 *                #                    ___/`---'\___                  #
 *                #                  .' \\|     |# '.                 #
 *                #                 / \\|||  :  |||# \                #
 *                #                / _||||| -:- |||||- \              #
 *                #               |   | \\\  -  #/ |   |              #
 *                #               | \_|  ''\---/''  |_/ |             #
 *                #               \  .-\__  '-'  ___/-. /             #
 *                #             ___'. .'  /--.--\  `. .'___           #
 *                #          ."" '<  `.___\_<|>_/___.' >' "".         #
 *                #         | | :  `- \`.;`\ _ /`;.`/ - ` : | |       #
 *                #         \  \ `_.   \_ __\ /__ _/   .-` /  /       #
 *                #     =====`-.____`.___ \_____/___.-`___.-'=====    #
 *                #                       `=---='                     #
 *                #     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~   #
 *                #                                                   #
 *                #               佛祖保佑          永无BUG            	      #
 *                #                                                   #
 *                #####################################################
 */
public class Main {

	/**
	 * @param args
	 */
	public static void main(String[] args) {
 
		 
		EnumTest.EnumTesta e =new Main().canshu();
		 switch (e) {
		case ONE:
			System.out.println(e.getB());
			break;

		default:
			break;
		}
		 
	}
	 

	 private  EnumTest.EnumTesta  canshu() {
		 EnumTest.EnumTesta e;
		 e=EnumTest.EnumTesta.ONE;
		 return e;
	}
}
